#ifndef _INFODLG_H_
#define _INFODLG_H_

#include "DialogLayer.h"

class CCInfoDialog :public DialogLayer
{
public:
	CCInfoDialog(void);
	~CCInfoDialog(void);

	/************************************************************************/
	/* 初始化对话框                                                                     */
	/************************************************************************/
	virtual bool onInitDialog();
	/************************************************************************/
	/* 创建对话框*/
	/************************************************************************/
	CREATE_FUNC(CCInfoDialog);

	/************************************************************************/
	/* 返回和下一关按钮                                                                     */
	/************************************************************************/
	void backMenuItemCallback(CCObject *obj);
};

#endif